		  
		  #Область ОбработчикиСобытийФормы
		  
		  &НаСервере
		  Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			  
			  ПутьККаталогу = ПутьКаталогаПоУмолчанию();
			  
		  КонецПроцедуры
		  
		  #КонецОбласти
		  
		  #Область ОбработчикиКомандФормы
		  
		  &НаКлиенте
		  Процедура ВыбратьФайлы(Команда)
			  
			  ВыбратьЗагрузитьФайлыКлиент();
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура НайтиПоИНН(Команда)
			  
			  Если ПроверкаПередВыполнениеПоиска() Тогда
				  
				  ВыбратьЗагрузитьФайлыКлиент();
				  
			  КонецЕсли;
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ПутьККаталогуНажатие(Элемент, СтандартнаяОбработка)
			  
			  СтандартнаяОбработка = Ложь;
			  
			  ВыбратьКаталогДляПоискаФайлов();
			  
		  КонецПроцедуры
		  
		  #КонецОбласти
		  
		  #Область СлужебныеПроцедурыИФункции
		  
		  #Область МетодыЗаполненияРезультатПоиска
		  
		  &НаСервереБезКонтекста
		  Процедура ЗаполнитьОбъектДанными(ОбъектДляЗаполнения, ОбъектXdto)
			  
			  ЗаполнитьОсновныеДанныеОбъекта(ОбъектДляЗаполнения, ОбъектXdto); 
			  
			  ЗаполнитьАдресаОбъекта(ОбъектДляЗаполнения["Адреса"], ОбъектXdto);
			  
			  ЗаполнитьСведенияВидовДеятельностиОбъекта(ОбъектДляЗаполнения["ВидыДеятельности"], ОбъектXdto);
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Функция ТипКонтрагентаОбъектаXdto(ОбъектXdto)
			  
			  ТипКонтрагента = ТипФизЛицо();
			  
			  Если ОбъектXdto.Свойства().Получить("ОргВклМСП") <> Неопределено Тогда
				  ТипКонтрагента = ТипЮрЛицо();
			  КонецЕсли;
			  
			  Возврат ТипКонтрагента;
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Процедура ЗаполнитьОсновныеДанныеОбъекта(ОбъектДляЗаполнения, ОбъектXdto)
			  
			  ТипКонтрагента = ТипКонтрагентаОбъектаXdto(ОбъектXdto);
			  
			  Если ТипКонтрагента = ТипЮрЛицо() Тогда
				  
				  Значение = ОбъектXdto.Получить(ОбъектXdto.Свойства().Получить("ОргВклМСП"));
				  Наименование = Значение.НаимОрг;
				  
			  Иначе
				  
				  Значение = ОбъектXdto.Получить(ОбъектXdto.Свойства().Получить("ИПВклМСП"));
				  Значение = Значение.ФИОИП;
				  Наименование = СтрШаблон("%1 %2 %3", Значение.Фамилия, Значение.Имя, Значение.Отчество);
				  
			  КонецЕсли;
			  
			  ОбъектДляЗаполнения.ТипКонтрагента = ТипКонтрагента;
			  ОбъектДляЗаполнения.Наименование   = Наименование;
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Процедура ЗаполнитьАдресаОбъекта(ОбъектДляЗаполнения, ОбъектXdto)
			  
			  Свойство = ОбъектXdto.Свойства().Получить("СведМН");
			  Если Свойство = Неопределено Тогда
				  Возврат;
			  КонецЕсли;
			  
			  ОбъектXdto_Адреса = ОбъектXdto.Получить(Свойство);
			  СписокСвойств = ОбъектXdto_Адреса.Свойства();
			  
			  Для каждого Свойство Из СписокСвойств Цикл
				  
				  Тип = Свойство.Имя; 
				  Значение = ОбъектXdto_Адреса.Получить(Свойство); 
				  
				  Если ТипЗнч(Значение) = Тип("ОбъектXDTO") Тогда
					  Тип         = Значение.Тип; 
					  Значение    = Значение.Наим;
				  КонецЕсли;
				  
				  СтрокаАдреса = СтруктураАдреса();
				  СтрокаАдреса["Тип"]      = Тип;
				  СтрокаАдреса["Значение"] = Значение;
				  
				  ОбъектДляЗаполнения.Добавить(СтрокаАдреса);
				  
			  КонецЦикла;
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Процедура ЗаполнитьСведенияВидовДеятельностиОбъекта(ОбъектДляЗаполнения, ОбъектXdto)
			  
			  Свойство = ОбъектXdto.Свойства().Получить("СвОКВЭД");
			  Если Свойство = Неопределено Тогда
				  Возврат;
			  КонецЕсли;
			  
			  ОбъектXdto_СвОКВЭД = ОбъектXdto.Получить(Свойство);
			  
			  Свойства = ОбъектXdto_СвОКВЭД.Свойства();
			  Если Свойства.Количество() = 0 Тогда
				  Возврат;
			  КонецЕсли;
			  
			  Для каждого Свойство Из Свойства Цикл
				  
				  ЭтоСписокXDTO = ЭтоСписокXDTO(Свойство);
				  
				  Если ЭтоСписокXDTO Тогда
					  
					  Значение = ОбъектXdto_СвОКВЭД.ПолучитьСписок(Свойство);
					  ЗаполнитьВидыДеятельностиИзСпискаXdto(ОбъектДляЗаполнения, Значение);
					  
				  Иначе
					  
					  Значение = ОбъектXdto_СвОКВЭД.Получить(Свойство);
					  ДобавитьВидДеятельностиВОбъект(ОбъектДляЗаполнения, Значение);
					  
				  КонецЕсли;
				  
			  КонецЦикла;
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Процедура ЗаполнитьВидыДеятельностиИзСпискаXdto(ОбъектЗаполнения, СписокXdto)
			  
			  Для каждого Строка Из СписокXdto Цикл
				  ДобавитьВидДеятельностиВОбъект(ОбъектЗаполнения, Строка);
			  КонецЦикла;
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Процедура ДобавитьВидДеятельностиВОбъект(ОбъектЗаполнения, ОбъектXDTO)
			  
			  Строка = СтруктураВидаДеятельности();
			  Строка["Код"]          = ОбъектXDTO.КодОКВЭД;
			  Строка["Наименование"] = ОбъектXDTO.НаимОКВЭД;
			  ОбъектЗаполнения.Добавить(Строка);
			  
		  КонецПроцедуры
		  
		  #КонецОбласти
		  
		  #Область ОписаниеОбъектовРезультата
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция РезультатПоиска()
			  
			  Структура = Новый Структура;
			  Структура.Вставить("РезультатВыполнения", Ложь);
			  Структура.Вставить("Данные",              СтруктураДанныхКонтрагента());
			  Возврат Структура;
			  
		  КонецФункции
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция СтруктураДанныхКонтрагента()
			  
			  Структура = Новый Структура;
			  Структура.Вставить("ТипКонтрагента", "");
			  Структура.Вставить("Наименование",   "");
			  
			  Структура.Вставить("ВидыДеятельности",   Новый Массив);
			  Структура.Вставить("Адреса",             Новый Массив);
			  
			  Возврат Структура;
			  
		  КонецФункции
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция СтруктураАдреса()
			  
			  Структура = Новый Структура;
			  Структура.Вставить("Тип",      "");
			  Структура.Вставить("Значение", "");
			  Возврат Структура;
			  
		  КонецФункции
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция СтруктураВидаДеятельности()
			  
			  Структура = Новый Структура;
			  Структура.Вставить("Код",          "");
			  Структура.Вставить("Наименование", "");
			  Возврат Структура;
			  
		  КонецФункции
		  
		  #КонецОбласти
		  
		  #Область МетодыВыбораФайловИЗагрузки
		  
		  &НаКлиенте
		  Процедура ВыбратьЗагрузитьФайлыКлиент()
			  
			  ОписаниеОповещенияОЗавершении     = Новый ОписаниеОповещения("ПослеЗавершенияПомещенияФайлов", ЭтаФорма, ИНН);
			  ОписаниеОповещенияОХодеВыполнения = Новый ОписаниеОповещения("ОписаниеОповещенияОХодеВыполнения", ЭтаФорма);
			  
			  СтрокаПоиска = ПутьККаталогу + "\*.xml";
			  НачатьПомещениеФайловНаСервер(ОписаниеОповещенияОЗавершении, ОписаниеОповещенияОХодеВыполнения, , СтрокаПоиска, ЭтаФорма.УникальныйИдентификатор);
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ОписаниеОповещенияОХодеВыполнения(ПомещаемыйФайлы, Помещено, ОтказОтПомещенияФайла, ПомещеноВсего, ОтказОтПомещенияФайлов, Дополнительно) Экспорт
			  
			  Состояние("Помещение файлов", ПомещеноВсего);
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ПослеЗавершенияПомещенияФайлов(ПомещенныеФайлы, ИНН) Экспорт
			  
			  Если ПомещенныеФайлы = Неопределено Тогда
				  
				  ПоказатьПредупреждение(, "Не удалось загрузить файлы в систему!", 10, "Внимание!");
				  
			  Иначе
				  
				  ВыполнитьПоискЗагрузкуИзФайлов(ПомещенныеФайлы, ИНН); 
				  
			  КонецЕсли;
			  
		  КонецПроцедуры
		  
		  #КонецОбласти
		  
		  #Область МетодыПоиска
		  
		  &НаКлиенте
		  Процедура ВыполнитьПоискЗагрузкуИзФайлов(ПомещенныеФайлы, ИНН)
			  
			  МассивАдресовФайлов = МассивАдресовВременногоХранилищаФайлов(ПомещенныеФайлы);
			  Результат = НайтиДанныеВМассивеФайлов(МассивАдресовФайлов, ИНН);
			  
			  ЗаполнитьРеквизитыФормыНайденнымиЗначениями(Результат["Данные"]);
			  
			  ЗаполнитьЗаголовкиПолейФормыКлиент();
			  
			  Если Не Результат["РезультатВыполнения"] Тогда
				  ПоказатьПредупреждение(Неопределено, "По указанному ИНН - ничего не найдено!Проверьте правильность указанного ИНН!", 10, "Внимание!");
			  КонецЕсли;
			  
		  КонецПроцедуры
		  
		  &НаСервереБезКонтекста
		  Функция НайтиДанныеВМассивеФайлов(ПомещенныеФайлы, ИНН)
			  
			  Результат = РезультатПоиска();
			  
			  ВыполняемПоиск = Истина;
			  Индекс = 0;
			  Пока ВыполняемПоиск И Индекс <= ПомещенныеФайлы.ВГраница() Цикл
				  
				  АдресаВрВременномХранилище = ПомещенныеФайлы.Получить(Индекс);
				  
				  ИмяФайла    = ВременныйФайлИзАдресаВременногоХранилища(АдресаВрВременномХранилище);
				  Объект_Xdto = Xml_в_Xdto(ИмяФайла);
				  
				  Результат = ВыполнитьПоискВОбъектеXDTO(Объект_Xdto, ИНН);
				  
				  ВыполняемПоиск = Не Результат.РезультатВыполнения;
				  
				  УдалитьФайлы(ИмяФайла);
				  
				  Индекс = Индекс + 1;
				  
			  КонецЦикла;
			  
			  Возврат Результат;
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Функция ВыполнитьПоискВОбъектеXDTO(Объект_Xdto, ИНН)
			  
			  Результат = РезультатПоиска();
			  
			  СписокДокументов = Объект_Xdto.Документ;
			  
			  ВыполняемПоиск = Истина;
			  Индекс = 0;
			  
			  Пока ВыполняемПоиск И Индекс <= СписокДокументов.Количество() - 1 Цикл
				  
				  ОбъектXDTO = СписокДокументов.Получить(Индекс);
				  
				  ВыполняемПоиск = Не НашлиИннВОбъектеXdto(ОбъектXDTO, ИНН);
				  
				  Если Не ВыполняемПоиск Тогда
					  
					  Результат.РезультатВыполнения = Истина;
					  ЗаполнитьОбъектДанными(Результат.Данные, ОбъектXDTO);
					  
				  КонецЕсли;
				  
				  Индекс = Индекс + 1;
				  
			  КонецЦикла;
			  
			  Возврат Результат;
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Функция НашлиИннВОбъектеXdto(Объект_Xdto, ИНН)
			  
			  ИннОбъекта = ""; 
			  Если Не Объект_Xdto.Свойства().Получить("ИПВклМСП") = Неопределено Тогда
				  
				  Значение = Объект_Xdto.Получить(Объект_Xdto.Свойства().Получить("ИПВклМСП"));
				  ИннОбъекта = Значение.ИННФЛ;
				  
			  ИначеЕсли Не Объект_Xdto.Свойства().Получить("ОргВклМСП") = Неопределено Тогда	  
				  
				  Значение = Объект_Xdto.Получить(Объект_Xdto.Свойства().Получить("ОргВклМСП"));
				  ИннОбъекта = Значение.ИННЮЛ;
				  
			  КонецЕсли;
			  
			  Возврат ИннОбъекта = ИНН;
			  
		  КонецФункции
		  
		  #КонецОбласти
		  
		  #Область Прочее
		  
		  &НаКлиенте
		  Функция ПроверкаПередВыполнениеПоиска()
			  
			  Результат = ПроверитьЗаполнение();
			  
			  Если Результат И ПутьККаталогу = ПутьКаталогаПоУмолчанию() Тогда
				  
				  ПоказатьПредупреждение(Неопределено, "Выберите каталог для поиска данных в файлах xml", 10, "Внимание!"); 
				  
				  Результат = Ложь;
				  
			  КонецЕсли;
			  
			  Возврат Результат;
			  
		  КонецФункции
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция ТипФизЛицо()
			  
			  Возврат "ФизЛицо";
			  
		  КонецФункции
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция ТипЮрЛицо()
			  
			  Возврат "ЮрЛицо";
			  
		  КонецФункции
		  
		  &НаКлиенте
		  Процедура ЗаполнитьРеквизитыФормыНайденнымиЗначениями(ЗначенияОбъекта)
			  
			  ЗаполнитьШапкуФормы(ЗначенияОбъекта);
			  
			  Адреса.Очистить();
			  ЗаполнитьАдресаДоставкиФормы(ЗначенияОбъекта["Адреса"]);
			  
			  ВидыДеятельности.Очистить();
			  ЗаполнитьВидыДеятельностиДоставкиФормы(ЗначенияОбъекта["ВидыДеятельности"]);
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ЗаполнитьЗаголовкиПолейФормыКлиент()
			  
			  ЗаполнитьЗаголовкиПоляНаименованияКлиент();
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ЗаполнитьЗаголовкиПоляНаименованияКлиент()
			  
			  ЗаголовокПоля = "Наименование";
			  
			  Если ЮрЛицо Тогда
				  ЗаголовокПоля = "Наименование организации";	
			  ИначеЕсли ФизЛицо Тогда
				  ЗаголовокПоля = "ФИО(физ. лица)";	
			  КонецЕсли;
			  
			  Элементы.Наименование.Заголовок = ЗаголовокПоля;
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ЗаполнитьШапкуФормы(ЗначенияОбъекта)
			  
			  Наименование = ЗначенияОбъекта["Наименование"];
			  
			  ФизЛицо = ЗначенияОбъекта["ТипКонтрагента"] = ТипФизЛицо();
			  ЮрЛицо  = ЗначенияОбъекта["ТипКонтрагента"] = ТипЮрЛицо();
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ЗаполнитьАдресаДоставкиФормы(МассивАдресов)
			  
			  Для каждого СтрокаАдреса Из МассивАдресов Цикл
				  
				  НоваяСтрока = Адреса.Добавить();
				  ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаАдреса);
				  
			  КонецЦикла;
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ЗаполнитьВидыДеятельностиДоставкиФормы(МассивВидовДеятельности)
			  
			  Для каждого СтрокаВидаДеятельности Из МассивВидовДеятельности Цикл
				  
				  НоваяСтрока = ВидыДеятельности.Добавить();
				  ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВидаДеятельности);
				  
			  КонецЦикла;
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Функция МассивАдресовВременногоХранилищаФайлов(ПомещенныеФайлы)
			  
			  МассивАдресовФайлов = Новый Массив;
			  Для каждого Строка Из ПомещенныеФайлы Цикл
				  МассивАдресовФайлов.Добавить(Строка.Адрес);
			  КонецЦикла;
			  
			  Возврат МассивАдресовФайлов;
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Функция ЭтоСписокXDTO(Свойство)
			  
			  Возврат (Свойство.ВерхняяГраница > 1 ИЛИ Свойство.ВерхняяГраница = -1);
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Функция Xml_в_Xdto(Знач ИмяФайла)
			  
			  ЧтениеXML = Новый ЧтениеXML;
			  ЧтениеXML.ОткрытьФайл(ИмяФайла);
			  
			  ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
			  
			  ЧтениеXML.Закрыть();
			  
			  Возврат ОбъектXDTO;
			  
		  КонецФункции
		  
		  &НаСервереБезКонтекста
		  Функция ВременныйФайлИзАдресаВременногоХранилища(Знач АдресаВрВременномХранилище)
			  
			  ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			  
			  ДД = ПолучитьИзВременногоХранилища(АдресаВрВременномХранилище);
			  ДД.Записать(ИмяВременногоФайла);
			  
			  Возврат ИмяВременногоФайла;
			  
		  КонецФункции
		  
		  #КонецОбласти	  
		  
		  #Область МетодыВыбораКаталога
		  
		  &НаКлиенте
		  Процедура ВыбратьКаталогДляПоискаФайлов()
			  
			  Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			  Диалог.Каталог = "";
			  Диалог.МножественныйВыбор = Ложь;
			  Диалог.Заголовок = "Выберите каталог с распакованными файлами";
			  
			  ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеВыбораКаталогаЗавершение", ЭтотОбъект);
			  
			  Диалог.Показать(ОповещениеЗавершения);
			  
		  КонецПроцедуры
		  
		  &НаКлиенте
		  Процедура ПослеВыбораКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
			  
			  Если Результат <> Неопределено Тогда
				  
				  ПутьККаталогу = Результат.Получить(0);
				  
			  КонецЕсли;
			  
		  КонецПроцедуры
		  
		  &НаКлиентеНаСервереБезКонтекста
		  Функция ПутьКаталогаПоУмолчанию()
			  
			  Возврат "Выберите каталог";
			  
		  КонецФункции
		  
		  #КонецОбласти
		  
		  #КонецОбласти
