#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
  // Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ПриЗаписи(Отказ)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		
	КонецПроцедуры
	
	Процедура ПередУдалением(Отказ)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
	КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
  // Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  // Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли